
var headTable=['节次','上课时间','周一','周二','周三','周四','周五']
var mainTable1=[
    ['1','8:00-8:20','班会','班会','班会','班会','班会'],
    ['2','8:30-9:10','数学（李琛冰/徐捷）','语文（罗佑兰）','地理（林莉）','英语（朱雪艳）','数学辅导(李琛冰/徐捷)'],
    ['3','9:20-10:00','数学（李琛冰/徐捷）','政治合格（但敏学）','地理（林莉）','英语辅导（朱雪艳）','英语辅导（朱雪艳）'],
    [' ','10:00-10:20','眼保健操','眼保健操','眼保健操','眼保健操','眼保健操'],
    ['4','10:20-11:00','化学合格（姚斐娜/张珂）','数学（李琛冰/徐捷）','数学（李琛冰/徐捷）','数学辅导（李琛冰/徐捷）','历史等级（陈鑫）'],
    ['5','11：10-11：50','英语（朱雪艳）','物理等级（刘一波）','英语（朱雪艳）','语文辅导（罗佑兰）','政治合格（但敏学）'],
    [' ','11：50-13：00','午休','午休','午休','午休','午休'],
    ['6','13：00-13：40','物理合格（刘一波）','体育锻炼','物理合格（刘一波）','体育锻炼','体育锻炼'],
    ['7','13：50-14：30','美术（张红霞）','历史等级（陈鑫）','化学合格（姚斐娜/张珂）','历史合格（杨磊）','地理（林莉）'],
    [' ','14：30-17：00','自修和答疑','自修和答疑','自修和答疑','自修和答疑','自修和答疑'],
    [' ','17：00-18：00','休息','休息','休息','休息','休息'],
    ['8','18：00-18：40','历史等级辅导（陈鑫）','英语辅导（朱雪艳）','语文辅导（罗佑兰）','化学等级辅导（张珂）','物理等级辅导（刘一波）'],
    ['9','18：50-19：30','语文辅导（罗佑兰）','生物等级辅导（程亮）','语文辅导（罗佑兰）','地理辅导（林莉）','化学等级辅导（张珂）'],
    ['10','19：40-20：20','地理辅导（林莉）','自修','生物等级辅导（程亮）','政治合格辅导（但敏学）','自修'],
    ['11','20：30-21：10','生物等级辅导（程亮）','自修','政治等级辅导（范凤美）','生物等级辅导（程亮）','生物等级辅导（程亮）'],
    [' ','21：10-','上交作业','上交作业','上交作业','上交作业','上交作业']
]
var mainTable2=[
    ['1','8:00-8:20','班会','班会','班会','班会','班会'],
    ['2','8:30-9:10','数学(李琛冰/徐捷)','语文(罗佑兰)','地理等级(林莉)','英语(朱雪艳)','生物等级(程亮)'],
    ['3','9:20-10:00','数学(李琛冰/徐捷)','物理等级(刘一波)','地理等级(林莉)','英语(朱雪艳)','英语(朱雪艳)'],
    ['','10:00-10:20','眼保健操','眼保健操','眼保健操','眼保健操','眼保健操'],
    ['4','10:20-11:00','化学合格(姚斐娜/张珂)','政治合格/等级(但敏学/范凤美)','数学(李琛冰/徐捷)','数学(李琛冰/徐捷)','历史等级(陈鑫)'],
    ['5','11:10-11:50','地理等级(林莉)','美术(张红霞)','英语(朱雪艳)','语文(罗佑兰)','政治合格/等级(但敏学/范凤美）'],
    ['','11:50-13:00','午休','午休','午休','午休','午休'],
    ['6','13:00-13:40','生物等级(程亮)','自修','生物等级(程亮)','物理合格(刘一波)','地理等级(林莉)'],
    ['7','13:50-14:30','物理合格(刘一波)','历史等级(陈鑫)','化学合格(姚斐娜/张珂)','历史合格(杨磊)','地理等级(林莉)'],
    ['','14:40-16:40','作业和语文答疑','作业和数学答疑','作业和英语答疑','作业和等级答疑(物化生)','作业和等级答疑(政史地)'],
    ['','16:50-17:30','体育活动','体育活动','体育活动','休息','心理'],
    ['','17:30-18:30','吃饭','吃饭','吃饭','吃饭','吃饭'],
    ['8','18:30-19:10','历史等级辅导(陈鑫)','英语辅导(朱雪艳)','政治等级辅导(范凤美)','化学等级辅导(张珂)','数学辅导(李琛冰/徐捷)'],
    ['9','19:20-20:00','语文辅导(罗佑兰)','生物等级辅导(程亮)','语文辅导(罗佑兰)','政治合格/等级辅导(但敏','化学等级辅导(张珂)'],
    ['10','20:10-20:50','英语辅导(朱雪艳)','数学辅导(李琛冰/徐捷)','语文辅导(罗佑兰)','生物等级辅导(程亮)','物理等级辅导(刘一波)'],
    ['11','21:00-22:00','晚自修','晚自修','晚自修','晚自修','晚自修']
]
var mainTable=[
    ['1','8:00-8:20','班会','班会','班会','班会','班会'],
    ['2','8:30-9:10','数学(李琛冰/徐捷)','英语(朱雪艳)','英语(朱雪艳)','语文(罗佑兰)','生物等级(程亮)/自修'],
    ['3','9:20-10:00','数学(李琛冰/徐捷)','语文(罗佑兰)','语文(罗佑兰)','化学等级(张珂)/自修','生物等级(程亮)/自修'],
    ['','10:00-10:20','眼保健操','眼保健操','眼保健操','眼保健操','眼保健操'],
    ['4','10:20-11:00','英语(朱雪艳)','数学(李琛冰/徐捷)','数学(李琛冰/徐捷)','英语(朱雪艳)','数学(李琛冰/徐捷)'],
    ['5','11:10-11:50','语文(罗佑兰)','历史等级(陈鑫)/自修','化学等级(张珂)/自修','英语(朱雪艳)','地理等级(林莉)/自修'],
    ['','11:50-13:10','午休','午休','午休','午休','午休'],
    ['6','13:10-13:50','地理等级(林莉)/自修','化学等级(张珂)/自修','物理合格(施健)','物理等级(刘一波)/自修','化学合格(娄宏磊)'],
    ['7','14:00-14:40','化学合格(娄宏磊)','生物等级(程亮)/自修','政治合格(但敏学/范凤美)','历史合格(杨磊)','美术(张红霞)'],
    ['8','15:00-15:40','政治合格(但敏学/范凤美)','物理合格(施健)','生物等级(程亮)/自修','地理等级(林莉)/自修','物理等级(刘一波)/自修'],
    ['9','15:50-16:30','生物等级(程亮)/自修','体育活动','地理等级(林莉)/自修','政治合格(但敏学/范凤美)','心理(万燕)/政治限时作业'],
    ['10','16:40-17:20','自修','物理等级(刘一波)/自修','地理等级(林莉)/自修','历史等级(陈鑫)/自修','体育活动/历史限时作业'],
    ['11','18:30-20:00','语文限时作业课','数学限时作业课','英语限时作业课','物理限时作业课','化学限时作业课'],
    ['','20:00-21:15','晚自修','晚自修','晚自修','晚自修','晚自修'],
]
var linkList={
  
}

var table = new Vue({
  el: '#main-table',
  data: {
    head : headTable,
    table: mainTable 
  }
})